SELECT
    Н_УЧЕНИКИ.ГРУППА,
    Н_УЧЕНИКИ.ИД, 
    Н_ЛЮДИ.ФАМИЛИЯ, 
    Н_ЛЮДИ.ИМЯ, 
    Н_ЛЮДИ.ОТЧЕСТВО,
    Н_УЧЕНИКИ.П_ПРКОК_ИД
FROM 
    Н_ЛЮДИ
JOIN 
    Н_ОБУЧЕНИЯ ON Н_ЛЮДИ.ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
JOIN 
    Н_УЧЕНИКИ ON Н_ОБУЧЕНИЯ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
    AND Н_УЧЕНИКИ.ПРИЗНАК = 'отчисл'
JOIN 
    Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
JOIN 
    Н_ФОРМЫ_ОБУЧЕНИЯ ON Н_ПЛАНЫ.ФО_ИД = Н_ФОРМЫ_ОБУЧЕНИЯ.ИД
    AND Н_ФОРМЫ_ОБУЧЕНИЯ.НАИМЕНОВАНИЕ = 'заочная'
JOIN 
    Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ ON Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ.ИД = Н_ПЛАНЫ.НАПС_ИД
JOIN 
    Н_НАПР_СПЕЦ ON Н_НАПР_СПЕЦ.ИД = Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ.НС_ИД
    AND Н_НАПР_СПЕЦ.КОД_НАПРСПЕЦ = '230101'
WHERE 
    Н_ПЛАНЫ.ДАТА_УТВЕРЖДЕНИЯ IN (
        SELECT ДАТА_УТВЕРЖДЕНИЯ
        FROM Н_ПЛАНЫ
        WHERE DATE(ДАТА_УТВЕРЖДЕНИЯ) = DATE('2012-09-01')
    );