SELECT COUNT(*) AS "КОЛИЧЕСТВО_ТРОЕЧНИКОВ"
FROM (SELECT "Н_УЧЕНИКИ"."ИД"
  	FROM "Н_УЧЕНИКИ"
           	INNER JOIN "Н_ПЛАНЫ" ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
           	INNER JOIN "Н_ОТДЕЛЫ" ON "Н_ОТДЕЛЫ"."ИД" = "Н_ПЛАНЫ"."ОТД_ИД"
           	INNER JOIN "Н_ВЕДОМОСТИ" ON "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
  	WHERE "Н_ОТДЕЛЫ"."КОРОТКОЕ_ИМЯ" = 'КТиУ'
  	GROUP BY "Н_УЧЕНИКИ"."ИД"
  	HAVING AVG(CAST("Н_ВЕДОМОСТИ"."ОЦЕНКА" AS INT))
         	FILTER (WHERE "Н_ВЕДОМОСТИ"."ОЦЕНКА" ~ '^[2-5]$') BETWEEN 3.0 AND 3.5) "ИДТРОЕЧНИКОВ"; 
